/*****************************************************
 * Knob.ino 
 * 目的:
 *  測試旋轉電位計功能
 * 方法:
 *  旋轉電位計
 * 步驟:
 *  向左或向右旋轉"電位計"
 * 結果:
 *  觀察序列埠輸出視窗的值(向右旋轉,輸出值愈大)
*****************************************************/

#define KNOB_PIN A0 //定義旋轉電位計腳位連接至A0腳
 

/************************* 初始設定 *******************/
void setup()
{
  pinMode(KNOB_PIN, INPUT);//設定KNOB_PIN為輸入接腳
  Serial.begin(9600);
}

/************************* 主程式 *********************/
void loop() 
{
    float i=0,j=0,data;

    //讀取旋轉電位計類比輸出值並轉換成相對應的電阻值
    data = analogRead(KNOB_PIN);
    i=data/1023;
    j=(1-i)*1000;
    
    Serial.print("Resistance value is: ");
    Serial.print(j);
    Serial.println("Ω");
    delay(200);
}
