/*****************************************************
 * Buzzer.ino 
 * 目的:
 *  測試蜂鳴器功能
 * 方法:
 *  蜂鳴器
 * 步驟:
 *  直接執行程式
 * 結果:
 *  觀察蜂鳴器是否發出高低音頻的聲音
*****************************************************/

#define BUZZER_PIN 36 //定義蜂鳴器輸出腳位連接至36腳


/************************* 初始設定 *********************/
void setup()  
{  
    pinMode(BUZZER_PIN, OUTPUT); //設定BUZZER_PIN為輸出接腳
}  

/************************* 主程式 ***********************/
void loop()  
{  
    //設定音頻從低到高, 200Hz ~ 800Hz 
    for(int i = 200; i <= 800; i++)    
    {  
        tone(BUZZER_PIN, i);
    }  

    // 延遲1s
    delay(1000);                       

    //設定音頻從高到低, 800Hz ~ 200Hz
    for(int i= 800; i >= 200; i--)   
    {  
        tone(BUZZER_PIN, i);  
        delay(10);  
    }  
}
